# Series -> 1D

In [2]:
import pandas as pd
import numpy as np

In [3]:
data = np.array(["a","b","c","d"])
data

array(['a', 'b', 'c', 'd'], dtype='<U1')

In [4]:
s = pd.Series(data, index=[100,200,300,400])
s

100    a
200    b
300    c
400    d
dtype: object

# Data Frame -> 2D

In [5]:
data = [["sam","20"],["Ram","30"],["Jhon","40"]]
data

[['sam', '20'], ['Ram', '30'], ['Jhon', '40']]

In [8]:
df = pd.DataFrame(data,columns=["Name","Age"],
                  index=["row1","row2","row3"])
df

      Name Age
row1   sam  20
row2   Ram  30
row3  Jhon  40

In [23]:
# Create a Data Frame using Dictionary of Series
a = pd.Series([1,2,3],index=["a","b","c"])
b = pd.Series([1,2,3,4],index=["a","b","c","d"])
d = {"one":a,"two":b}
df=pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [24]:
# write a program in python create to add the first two column into the new col
a = pd.Series([1,2,3],index=["a","b","c"])
b = pd.Series([1,2,3,4],index=["a","b","c","d"])
c = a+b
d = {"one":a,"two":b,"total":c}
df=pd.DataFrame(d)
df

   one  two  total
a  1.0    1    2.0
b  2.0    2    4.0
c  3.0    3    6.0
d  NaN    4    NaN

In [34]:
#Write a program to add the fourth key and delete the second key after that in the same dictionary.Print the output of both the operation separately.
a = pd.Series([1,2,3],index=["a","b","c"])
b = pd.Series([1,2,3,4],index=["a","b","c","d"])
c = a+b
d = {"one":a,"two":b,"total":c}
d["fourth"] = a*b
df=pd.DataFrame(d)
df
d.pop("two")
df=pd.DataFrame(d)
df

   one  two  total  fourth
a  1.0    1    2.0     1.0
b  2.0    2    4.0     4.0
c  3.0    3    6.0     9.0
d  NaN    4    NaN     NaN

In [32]:
df

   one  total  fourth
a  1.0    2.0     1.0
b  2.0    4.0     4.0
c  3.0    6.0     9.0
d  NaN    NaN     NaN